Autodesk.Revit.DB.ComponentRepeaterSlot.IsTypeValidForSlot(Autodesk.Revit.DB.ElementId)
Determines whether instance of given family type can be used in the component repeater slot.
typeId:
The element id of the type.
Returns:
True if the family type can be used in the component repeater slot.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ComponentRepeaterSlot.FamilyType
The id of the family type of the component in the slot, or invalid id if the slot is empty.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Invalid type for the slot. The type must be an adaptive family with no shape handles.
In addition, it must have same category and same number of placement points as the current type of the repeater.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014